# Series -> 1D

In [3]:
import pandas as pd
import numpy as np

In [3]:
data = np.array(["a","b","c","d"])
data

array(['a', 'b', 'c', 'd'], dtype='<U1')

In [4]:
s = pd.Series(data, index=[100,200,300,400])
s

100    a
200    b
300    c
400    d
dtype: object

# Data Frame -> 2D

In [5]:
data = [["sam","20"],["Ram","30"],["Jhon","40"]]
data

[['sam', '20'], ['Ram', '30'], ['Jhon', '40']]

In [8]:
df = pd.DataFrame(data,columns=["Name","Age"],
                  index=["row1","row2","row3"])
df

      Name Age
row1   sam  20
row2   Ram  30
row3  Jhon  40

In [23]:
# Create a Data Frame using Dictionary of Series
a = pd.Series([1,2,3],index=["a","b","c"])
b = pd.Series([1,2,3,4],index=["a","b","c","d"])
d = {"one":a,"two":b}
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [24]:
# write a program in python create to add the first two column into the new col
a = pd.Series([1,2,3],index=["a","b","c"])
b = pd.Series([1,2,3,4],index=["a","b","c","d"])
c = a+b
d = {"one":a,"two":b,"total":c}
df=pd.DataFrame(d)
df

   one  two  total
a  1.0    1    2.0
b  2.0    2    4.0
c  3.0    3    6.0
d  NaN    4    NaN

In [34]:
#Write a program to add the fourth key and delete the second key after that in the same dictionary.Print the output of both the operation separately.
a = pd.Series([1,2,3],index=["a","b","c"])
b = pd.Series([1,2,3,4],index=["a","b","c","d"])
c = a+b
d = {"one":a,"two":b,"total":c}
d["fourth"] = a*b
df=pd.DataFrame(d)
df
d.pop("two")
df=pd.DataFrame(d)
df

   one  two  total  fourth
a  1.0    1    2.0     1.0
b  2.0    2    4.0     4.0
c  3.0    3    6.0     9.0
d  NaN    4    NaN     NaN

In [32]:
df

   one  total  fourth
a  1.0    2.0     1.0
b  2.0    4.0     4.0
c  3.0    6.0     9.0
d  NaN    NaN     NaN

In [1]:
# 19-10-2020

# Locating the element

In [4]:
a = pd.Series([1,2,3],index=["a","b","c"])
b = pd.Series([1,2,3,4],index=["a","b","c","d"])
c = a+b
d = {"one":a,"two":b,"total":c}
d["fourth"] = a*b
df=pd.DataFrame(d)

In [6]:
#loc
df.loc["b"]

one       2.0
two       2.0
total     4.0
fourth    4.0
Name: b, dtype: float64

In [8]:
#iloc
df.iloc[2]

one       3.0
two       3.0
total     6.0
fourth    9.0
Name: c, dtype: float64

In [9]:
#access the element in specified range 
df[2:4]

   one  two  total  fourth
c  3.0    3    6.0     9.0
d  NaN    4    NaN     NaN

# Adding two rows in the dataframe

In [10]:
import pandas as pd

In [12]:
df1=pd.DataFrame([[1,2],[3,4]],columns = ["a","b"])
df2=pd.DataFrame([[5,6],[7,8]],columns = ["a","b"])

In [15]:
df = df1.append(df2)
df=df.drop(0)

In [16]:
df

   a  b
1  3  4
1  7  8

write a program for student array consisting of marks from different subject. Perform the operation of adding rows and columns in the dataframe

In [49]:
import pandas as pd
m = [['Deep', 90, 70],['Dharita', 98, 75]]
df = pd.DataFrame(m, columns = ['Student' , 'Python', 'DS'], index=[1,2])
print(df)
df1 = df.append(pd.Series(['Amee',97,89], index=df.columns ),ignore_index=True)
print(df1)

# Total Marks
df.sum(1)

   Student  Python  DS
1     Deep      90  70
2  Dharita      98  75
   Student  Python  DS
0     Deep      90  70
1  Dharita      98  75
2     Amee      97  89

1    160
2    173
dtype: int64

In [47]:
df.sum(1)

1    160
2    173
dtype: int64

In [51]:
a = np.array([22,25,30,28,26])
b = np.array([21,18,20,27,29])

dic = {"python":a,"maths":b}
dic['add']= a+b
add_a = 0

for i in (a):
    add_a = add_a + i
    add_b =0
for i in (b):
    add_b = add_b + i

L=[add_a,add_b,0,0,0]
dic['coladd']=L
df = pd.DataFrame(dic)
print(df)
loc = df.iloc[:,3]
print(loc)

   python  maths  add  coladd
0      22     21   43     131
1      25     18   43     115
2      30     20   50       0
3      28     27   55       0
4      26     29   55       0
0    131
1    115
2      0
3      0
4      0
Name: coladd, dtype: int64